### Report for project: `terraform`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place

Terraform will perform the following actions:

  # module.website.module.cdn.aws_cloudfront_distribution.this[0] will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                             = "E1JJ5NAYUQCPD6"
        tags                           = {}
+       web_acl_id                     = (known after apply)
        # (20 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.website.module.waf.aws_wafv2_web_acl.default[0] will be created
+   resource "aws_wafv2_web_acl" "default" {
+       arn         = (known after apply)
+       capacity    = (known after apply)
+       description = "Managed by Terraform"
+       id          = (known after apply)
+       lock_token  = (known after apply)
+       name        = "gost-staging"
+       scope       = "CLOUDFRONT"
+       tags        = {
+           "Name"      = "gost-staging"
+           "Namespace" = "gost-staging"
        }
+       tags_all    = {
+           "Name"      = "gost-staging"
+           "Namespace" = "gost-staging"
        }

+       default_action {

+           block {
            }
        }

+       rule {
+           name     = "AmazonIpReputationList"
+           priority = 10

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAmazonIpReputationList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AmazonIpReputationList-metric"
+               sampled_requests_enabled   = false
            }
        }
+       rule {
+           name     = "AnonymousIpList"
+           priority = 5

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesAnonymousIpList"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = false
+               metric_name                = "AnonymousIpList-metric"
+               sampled_requests_enabled   = false
            }
        }
+       rule {
+           name     = "CommonRuleSet"
+           priority = 20

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesCommonRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = true
+               metric_name                = "CommonRuleSet-metric"
+               sampled_requests_enabled   = true
            }
        }
+       rule {
+           name     = "KnownBadInputsRuleSet"
+           priority = 30

+           override_action {

+               none {}
            }

+           statement {

+               managed_rule_group_statement {
+                   name        = "AWSManagedRulesKnownBadInputsRuleSet"
+                   vendor_name = "AWS"
                }
            }

+           visibility_config {
+               cloudwatch_metrics_enabled = true
+               metric_name                = "KnownBadInputsRuleSet-metric"
+               sampled_requests_enabled   = true
            }
        }

+       visibility_config {
+           cloudwatch_metrics_enabled = true
+           metric_name                = "gost-staging"
+           sampled_requests_enabled   = true
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>

*Pusher: @slapula, Action: `pull_request`, Workflow: `Terraform CI`*